Synwit-Co-Ltd/Synwit.SWM32_IAR/config/debugger/Synwit/SWM261.svd
        <register>
          <name>DATAPIN12</name>
          <description>DATAPIN12 register</description>
          <addressOffset>0x000070</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN13</name>
          <description>DATAPIN13 register</description>
          <addressOffset>0x000074</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN14</name>
          <description>DATAPIN14 register</description>
          <addressOffset>0x000078</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN15</name>
          <description>DATAPIN15 register</description>
          <addressOffset>0x00007C</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40004800</baseAddress>
    </peripheral>
    <peripheral>
      <name>TIMR0</name>
      <description>Registers group</description>
      <groupName>TIMR</groupName>
      <baseAddress>0x40043800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000034</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOAD</name>
          <description>LOAD register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOAD</name>
              <description>RELOAD field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>VALUE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEDGE</name>
              <description>ICEDGE field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TO</name>
              <description>TO field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OC0</name>
              <description>OC0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1</name>
              <description>OC1 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICR</name>
              <description>ICR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF</name>
              <description>ICF field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TO</name>
              <description>TO field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OC0</name>
              <description>OC0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1</name>
              <description>OC1 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICR</name>
              <description>ICR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF</name>
              <description>ICF field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALT</name>
          <description>HALT register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>OCCR</name>
          <description>OCCR register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCELVL</name>
              <description>FORCELVL field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITLVL</name>
              <description>INITLVL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEEN</name>
              <description>FORCEEN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMAT</name>
          <description>OCMAT register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RESERVED2</name>
          <description>RESERVED2 register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ICLOW</name>
          <description>ICLOW register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ICHIGH</name>
          <description>ICHIGH register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PREDIV</name>
          <description>PREDIV register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
