Synwit-Co-Ltd/Synwit.SWM32_IAR/config/debugger/Synwit/SWM261.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <description>Registers group</description>
      <groupName>MPU</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000018</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>ENDIAN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RCS1_0</name>
              <description>RCS1_0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCS1_0</name>
              <description>WCS1_0 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR1CS1</name>
              <description>WR1CS1 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS0WR0</name>
              <description>CS0WR0 field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED2</name>
          <description>RESERVED2 register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RESERVED3</name>
          <description>RESERVED3 register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>Registers group</description>
      <groupName>FMC</groupName>
      <baseAddress>0x40045000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00002C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <description>DATA register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADDR</name>
          <description>ADDR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ERASE</name>
          <description>ERASE register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ</name>
              <description>REQ field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE</name>
          <description>CACHE register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CEN</name>
              <description>CEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPEN</name>
              <description>CPEN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLR</name>
              <description>CCLR field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG0</name>
          <description>CFG0 register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>WREN field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>CFG1 register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG2</name>
          <description>CFG2 register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG3</name>
          <description>CFG3 register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG4</name>
          <description>CFG4 register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>STAT</name>
          <description>STAT register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEBUSY</name>
              <description>ERASEBUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROGBUSY</name>
              <description>PROGBUSY field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READBUSY</name>
              <description>READBUSY field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>FIFOEMPTY field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFOFULL field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READONLY</name>
              <description>READONLY field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITDONE</name>
              <description>INITDONE field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP</name>
          <description>REMAP register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
